var instructions_texts = {
	welcome_page : 
		"<h2 class= 'instruction' style = 'font-size: xx-large' dir='rtl' > <b>بیایید یاد بگیریم که چطور بازی رو انجام بدیم.</b>  &#127891; </h2><p dir='rtl' > برای ادامه گزینه‌ی 'NEXT' را انتخاب کنید.	</p>",
  
	second_page : 
		"<div class= 'instruction' dir='rtl'> <p>در ابتدا باید بگیم که شما قراره این بازی را به 2 شکل انجام بدید:</p> "+
    " <p> بار به‌صورت<b> تکی</b>  و 1 بار در قالب <b>یک گروه 2 نفره.</b> </p>" + 
    "<p>پس ازتون ممنون می‌شیم با توجه به این‌که الان دارید بازی رو تکی انجام می‌دید یا گروهی، حتما 10 روز بعد برای انجام اون شکل دیگه‌ی بازی در آزمایشگاه حاضر شوید.  </p>"+
    " </div>" 
	// + "<img src='../img/page1.png' width='70%' height='70%'>"
	,
	  
	third_page : 
	"<div class= 'instruction' dir='rtl'> <p>بازی شامل 3 بلوک است و شما در هر بلوک 40 دور تکلیف خود را انجام می‌دهید. </p> "+
	" <p>در شروع هر دور به‌صورت تصادفی یک  <u>نشانه‌ها‌ی تصویری</u> می‌بینید و با توجه به آن باید تصمیم بگیرید که در ادامه این دور <u>کاری بکنید</u> یا <u>کاری نکنید</u>.</p>"+
	"<p> به‌عبارت دیگر اگر تصمیمتان این بود که کاری بکنید با فشار دادن کلید مناسب از روی کی‌بورد محل <b>دایره مشکی</b> را گزارش کنید. </p> </div>" +
    "  <img src='../img/New_inst_images/page3.jpg' width='100%' height='100%'>",

	forth_page : 
	"<div class= 'instruction' dir='rtl'> <p> در این بازی 4 نشانه‌ی تصویری متفاوت وجود دارد. </p> "+
	"<p>شما باید با آزمون و خطا پیدا کنید بهترین استراتژی برای هر نشانه‌ی تصویری کدام است.</p>" +
	"<p>در واقع این‌جا تصمیم می‌گیرید که در مرحله‌ی بعد کاری بکنید یا کاری نکنید.</p>" +
	"</div>"+
	"<p>این‌ یک نمونه از تصویری است که ممکن است </p>" +
	"<img src = '../img/eighth_3_page.png' width='30%' height='30%'>",

	fifth_page : 
	"<img src='../img/New_inst_images/page5.jpg' width='100%' height='100%'>",
                 
	sixth_page : 
		"<div class= 'instruction' dir='rtl'> <p>حالا بیایید کمی دقیق‌تر شویم. </p> "+
		" <p>در هر دور ابتدا یک تصویر فرکتال خواهید دید. در این لحظه نیازی نیست کاری بکنید. </p>"+
		"<p> وقتی یاد می‌گیرید که برای هر تصویر کدام تصمیم بهتر است، که شانس برنده شدن خودتان را زیاد و شانس باختن خودتان را کم می‌کنید.</p> </div>" + 
		"<p dir='rtl'>این‌ یک نمونه از تصویری است که ممکن است ببینید:</p>"+
  	"<img src='../img/stim/f2_1.png' width='25%' height='25%'>",
  
	seventh_page : 
		"<div class= 'instruction' dir='rtl'><p>بعد از مکثی کوتاه، یک دایره‌ی مشکی خواهید دید که به صورت تصادفی سمت راست یا چپ یک مستطیل قرمز نمایش داده می‌شود.</p>"+
		"<p> با توجه به این‌که در مرحله قبل چه تصویری دیده باشید، این‌جا تصمیمتان را اجرا خواهید کر</p>"+
		"<p>به عبارت دیگر، برای مشخص کردن سمت دایره کلید چپ یا راست را فشار می‌دهید یا هیچ کاری نمی‌کنید.</p>"+
		"<p>برای انتخاب سمت چپ کلیدF  و برای انتخاب سمت راست از کلیدJ  باید استفاده کند.</p>"+
		"<p>اگر می‌خواهید کاری انجام دهید، ۱ ثانیه زمان دارید تا تصمیم خود را عملی کنید. اگر در این ۱ ثانیه کاری نکنید، تصور بر این است که شما از پاسخ دادن خودداری کرده اید.</p>"+
		"</div>"+
		"<img src='../img/New_inst_images/page7.jpg' width='40%' height='40%'>",
	eighth_page : 
		"<div class= 'instruction' dir='rtl'> <p>بعد از یک مکث کوتاه، یکی از سه نتیجه‌ی زیر را خواهید دید:</p> </div>"+
    // "<p> برای  نتیجه‌های مربوط به باختن ممکن است نمادهای &#10060;&#128184;&#10060; یا  &#x2796; را دریافت کنید. </p>"+
    // "<p> با انجام کار درست در هنگام ظاهر شدن دایره (یا کلید را فشار دادن یا از پاسخ دادن خودداری کردن) می توانید مطلوب‌ترین نتیجه را به دفعات به‌دست بیاورید .</p></div>" + 

    "<table style='margin-left:auto;margin-right:auto;table-layout:fixed !important; width:650px;border-spacing:3em;' dir='rtl'><tr>" +
    "<td> برد</td> <td style='font-size:30px;'> &#9989;&#128176;&#9989; </td>" +
    "</tr><tr>" +
    "<td>باخت</td> <td style='font-size:30px;'> &#10060;&#128184;&#10060; </td>" +
	"</tr><tr>" +
    "<td s>صفر</td> <td style='font-size:30px;'> &#x2796; </td>" +
    "</tr></table>",
  
	ninth_page : 
		"<img src='../img/New_inst_images/page9.jpg' width='80%' height='80%'>",
	
		ninth_p_page : 
	"<div class= 'instruction' dir='rtl'><p >نتیجه هر دور ( برنده یا بازنده شدن) احتمالاتی است یعنی ممکن است علیرغم تصمیم درست ضرر کنید. </p> " +
	"<p>اما با پیدا کردن بهترین استراتژی برای هر تصویر، می‌توانید احتمال دریافت نتیجه‌ی بهتر را بهینه کنید.</p>" +
	"<p>دقت کنید که برای بعضی از تصاویر استراتژی بهتر «کاری کردن» است و برای برخی دیگر بهترین استراتژی این است که «کاری نکنیم».</p>" +
	"<p>هدف شما در این بازی پیدا کردن و اجرای این استراتژی‌هاست.</p> </div>", 

	tenth_page :  
		"<div class= 'instruction' dir='rtl'> <p> <b>به نکاتی که در ادامه گفته می‌شود توجه کنید: </b></p> </div>"
    // "<p> <b> یعنی گاهی حتی اگر بهترین استراتژی را بدانید، ممکن است باز هم برنده نشوید، یا بازنده شوید.	</b> </p>" +
    // "<p>  با این حال، به یاد داشته باشید که برای هر تصویر یک استراتژی بهتر (یا فشار دادن یک کلید یا خودداری از پاسخ) وجود دارد که از دیگری بهتر است. <p></div>"
	,
  
  
	eleventh_page : 
		"<div class= 'instruction' dir='rtl'> <p>معنای هر تصویر در طول بازی ثابت خواهد بود.</p>"+
    "<p>این بازی آسان نیست. بنابراین ما شما را به سعی‌ و خطا و پیدا کردن بهترین استراتژی تشویق می‌کنیم.</p></div>",

	twelve_page : 
	"<div class= 'instruction' dir='rtl'> <p>لطفاً توجه داشته باشید که هیچ ارتباطی بین چپ یا راست آمدن دایره‌ها و تصاویر وجود ندارد.</p>"+
"</div>",

thirteenth_page : 
"<div class= 'instruction' dir='rtl'> <p>قبل از شروع بازی اصلی، برای تمرین و آشنا شدن با شرایط، ۱۲ دور به صورت تمرینی بازی را انجام خواهید داد.</p>"+
"<p>پس از آن بازی اصلی که به ۳ بلوک تقسیم شده، شروع می‌شود. می توانید بین هر بلوک ۱ دقیقه استراحت کنید.</p>"+
"<p>در پایان آزمایش برای بازی گروهی که انجام دادید مبلغ۴۰۰ هزار تومان به‌عنوان پاداش ثابت دریافت خواهید کرد. در ضمن مجموع امتیازهای شما شمرده می شود و به ازای امتیازی که در بازی به دست آورده‌اید تا سقف ۲۰۰ هزار تومان به پاداش ثابت شما اضافه می‌شود.</p>"+
"</div>",

};
	

var instructions = {
	type: 'instructions',
	pages: [
		instructions_texts.welcome_page, 
		instructions_texts.second_page,
		instructions_texts.third_page,
		instructions_texts.forth_page,
		instructions_texts.fifth_page,
		instructions_texts.sixth_page,
		instructions_texts.seventh_page,
		instructions_texts.eighth_page,
		instructions_texts.ninth_page,
		instructions_texts.ninth_p_page,
		instructions_texts.tenth_page,
		instructions_texts.eleventh_page,
		instructions_texts.twelve_page,
		instructions_texts.thirteenth_page

	],
	show_clickable_nav: true,

	data: {},
	on_finish: function(data) {

		jsPsych.data.addDataToLastTrial({
			exp_stage:"instructions",
			exp_part: "instructions"
		})
	}
}